W7D2/music_app/app/controllers/bands_controller.rb

INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "red velvet"], ["created_at", "2021-01-05 21:42:44.178843"], ["updated_at", "2021-01-05 21:42:44.178843"]]
---
  def create
    @band = current_user.bands.new(band_params)
    if @band.save

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @band = current_user.bands.find(params[:id])

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "blue velvet"], ["updated_at", "2021-01-05 21:47:47.202069"], ["id", 1]]
---
  def update
    @band = current_user.bands.find(params[:id])
    if @band.update_attributes(band_params)